//=============================================================================
//
// ゲームオーバー画面処理 [gameover.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _GAMEOVER_H_
#define _GAMEOVER_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================

HRESULT InitGameover(void);
void UninitGameover(void);
void UpdateGameover(void);
void DrawGameover(void);

#endif