//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

HRESULT InitRusult(int oldMode);
void UninitRusult(int oldMode);
void UpdateRusult(void);
void DrawRusult(void);

#endif
