//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

HRESULT InitTitle(int oldMode);
void UninitTitle(int oldMode);
void UpdateTitle(void);
void DrawTitle(void);

#endif
